let timeframe = 1d;
let timebin = 10m;
let signin_threshold = 5;  //Maybe let failedthreshold = 5;
SigninLogs
| where TimeGenerated >= ago(timeframe)
| where Appname ==
| summarize count () by IpAddress
| Order by Usserid desc
| Project Computer, Account, Userid, IpAddress
Dynamics365 
| where ResultCode == "50052,50057,50132,50143,130501"
| project UserId
) on $left.AccountUPN==$right.UserId

//Filter based on Appname, ResultCode,  Use Signinlogs Table
//Typical query
//SecurityEvent
| where TimeGenerated < startofday(ago(1d))
| where EventID in (4625) and Status=="0xc000006d"
| summarize min(TimeGenerated),  EventCount = count() by bin_at(TimeGenerated, 1h,now())
| order by TimeGenerated asc


Build new query using SignInLogs looking for failed logins with AppDisplayName being one of Dataverse, Microsoft Flow Portal, make.powerapps.com, PowerApps - apps.powerapps.com, Power Platform Admin Center

Legacy - 
Dynamics 365 Activity After Failed Logons

let threshold = 10;
SigninLogs
| where ResultType in ("50125", "50140", "70043", "70044")
| summarize count() by IPAddress
| where count_ >= threshold
| join (Dynamics365Activity
| extend IPAddress = tostring(split(ClientIP, ":")[0]))
on IPAddress
| project-rename FailedLogonCount = count_
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = IPAddress
