let timeframe = 1d;
let timebin = 10m;
SigninLogs
| where AppDisplayName in ("Dataverse","MicrosoftFlowPortal","make.powerapps.com","Power Platform Admin Center")
| where ResultType == "50052,50057,50132,50143,130501"
| summarize count() by IPAddress
| order by IPAddress desc 

Legacy - 
Dynamics 365 Activity After Failed Logons

let threshold = 10;
SigninLogs
| where ResultType in ("50125", "50140", "70043", "70044")
| summarize count() by IPAddress
| where count_ >= threshold
| join (Dynamics365Activity
| extend IPAddress = tostring(split(ClientIP, ":")[0]))
on IPAddress
| project-rename FailedLogonCount = count_
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = IPAddress
