let timeframe = 1d;
let timebin = 10m;
let signin_threshold = 5;  //Maybe let failedthreshold = 5;
SigninLogs
| where TimeGenerated >= ago(timeframe)
| where Appname == 
| where ResultCode == 
| summarize count () by IpAddress
| Order by Usserid desc
| Project Computer, Account, Userid, IpAddress


//Filter based on Appname, ResultCode,  Use Signinlogs Table
//Typical query
//SecurityEvent
| where TimeGenerated < startofday(ago(1d))
| where EventID in (4625) and Status=="0xc000006d"
| summarize min(TimeGenerated),  EventCount = count() by bin_at(TimeGenerated, 1h,now())
| order by TimeGenerated asc
