AuditLog
| where ActivityDisplayName in ("Add member to group", "Remove member from group")
| extend InitiatedByParsed = parse_json(InitiatedBy)
| extend UserPrincipalName = iff(isnotempty(InitiatedByParsed.user), tostring(InitiatedByParsed.user.userPrincipalName), ""),
         UserId = iff(isnotempty(InitiatedByParsed.user), tostring(InitiatedByParsed.user.id), ""),
         DisplayName = iff(isnotempty(InitiatedByParsed.user), tostring(InitiatedByParsed.user.displayname), ""),
         IpAddress = iff(isnotempty(InitiatedByParsed.user), tostring(InitiatedByParsed.user.ipAddress), ""),
         Identity = iff(isnotempty(InitiatedByParsed.user), "", tostring(InitiatedByParsed.identity))
| project ActivityDisplayName, UserPrincipalName, UserId, DisplayName, IpAddress, Identity


//Role Changes

AzureActivity
| where OperationNameValue contains "Microsoft.Authorization/roleAssignments"
| extend RoleName = tostring(parse_json(Properties).roleDefinitionName)
| extend Scope = tostring(parse_json(Properties).scope)
| extend Principal = tostring(parse_json(Properties).principalName)
| project TimeGenerated, OperationName, RoleName, Scope, Principal



AzureActivity
| where OperationName contains "Microsoft.Authorization/roleassignments"
| extend PropertiesParsed = parse_json(Properties)
| extend Caller = tostring(PropertiesParsed.caller),
         ClientIpAddress = tostring(PropertiesParsed.clientIpAddress),
         ActivityStatusValue = tostring(PropertiesParsed.activityStatus.value),
         PrincipalId = tostring(PropertiesParsed.principalId),
         RoleDefinitionId = tostring(PropertiesParsed.roleDefinitionId),
         Scope = tostring(PropertiesParsed.scope)
| project TimeGenerated, OperationName, Caller, ClientIpAddress, ActivityStatusValue, PrincipalId, RoleDefinitionId, Scope
