


NSG

AzureActivity
| where OperationNameValue == "Microsoft.Network/networkSecurityGroups/write"
| where ResourceProviderValue == "Microsoft.Network"
| summarize arg_max(TimeGenerated, *) by Caller


Cost by resource group

AzureActivity
| where OperationNameValue == "Microsoft.Network/networkSecurityGroups/write"
| where ResourceProviderValue == "Microsoft.Network"
| summarize arg_max(TimeGenerated, *) by Caller

Cost by service

Usage
| where Quantity > 0
| summarize TotalCost = sum(Quantity * MeterId * MeterRates) by ServiceName
| sort by TotalCost desc

Cost Trend over time

Usage
| where Quantity > 0
| summarize TotalCost = sum(Quantity * MeterId * MeterRates) by bin(TimeGenerated, 1d)
| render timechart


List of Users who have signed in

Usage
| where Quantity > 0
| summarize TotalCost = sum(Quantity * MeterId * MeterRates) by bin(TimeGenerated, 1d)
| render timechart

SigninLogs
| summarize count() by UserPrincipalName


Failed sign-ins by user

SigninLogs
| where Success == false
| summarize count() by UserPrincipalName

List of users with elevated priviledges

AuditLogs
| where Category == "Authorization"
| where OperationName == "Add Role Assignment"
| where TargetResources[0].Type == "Microsoft.Authorization/roleAssignments"
| where TargetResources[0].Scope == "/"
| extend UserPrincipalName = tostring(parse_json(TargetResources[0].Properties["principalName"]))
| summarize count() by UserPrincipalName

List of NSGs with open ports:

NetworkSecurityGroupEvent
| where ActionName == "Microsoft.Network/networkSecurityGroups/securityRules/write" 
| where Properties contains "destinationPortRange\": \"*\"" 
| summarize by ResourceId

List of failed VPN connections:

AzureDiagnostics
| where Category == "GatewayConnection" 
| where OperationName == "TunnelFailure" 
| summarize count() by ResourceGroup, ResourceProvider, Resource, TimeGenerated

List of VMs without a NSG:

AzureActivity
| where OperationNameValue == "Microsoft.Network/networkInterfaces/delete" 
| extend VMName = tostring(split(tostring(Properties["resourceUri"]), "/")[8])
| summarize by VMName
| join kind=leftanti (NetworkInterfaceEvent 
| where OperationName == "Microsoft.Network/networkInterfaces/securityRules/prepareNetworkInterfaceUpdate/action"
| summarize by ResourceId)
on VMName

List of virtual machines with missing critical security updates:

SecurityEvent 
| where EventID == "1116" 
| where Description contains "Critical" and Description contains "update(s) are missing" 
| summarize by Computer


Usage
| where TimeGenerated >= ago(1d)
| summarize sum(Quantity) by ResourceId
| join (ResourceContainer
| where type =~ "Microsoft.Compute/virtualMachines"
| project ResourceId, ResourceName, Location), on ResourceId
| project ResourceName, Location, sum_Quantity_GB=sum(Quantity)/1024/1024/1024
| order by sum_Quantity_GB desc



